---
kind: type
id: T:Autodesk.Revit.UI.PulldownButton
source: html/dc0b7036-00c3-865f-1ae1-e2730d997672.htm
---
# Autodesk.Revit.UI.PulldownButton

The PulldownButton object represents a button with a drop-down list on RibbonPanel.

## Syntax (C#)
```csharp
public class PulldownButton : RibbonButton
```

## Remarks
Use of this class is not supported in Revit Macros.